{"sermonData": [{"date": "Jul 18, 2018", "denom": "Baptist", "title": "Lesson 18: Negative Example: Pagans Series", "sermon": "Commentary on the Book of EphesiansBy: Tom Lowe Date: 8/29/17Lesson 18: Negative Example: Pagans (Ephesians 4:17-19)Ephesians 4:17-19 (KJV)17 This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind,18 Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:19 Who being past feeling have given themselves over unto lasciviousness, to work all uncleanness with greediness.IntroductionIn 4:1-16 Paul has dwelt upon those responsibilities which pertain especially to our relationships within the body of Christ. At verse 17 he turns to discuss duties, mostly of a moral nature, which concern our relation not only to fellow believers but more especially to the world around us.Born again believers, members of the body of Christ, are new creations. A believer is a new man; therefore, we are to put off all the clothing, the garments (the life), of the old man [This is the lost man, the unbeliever, called ‘Gentile’ in this passage], and put on the new (born again) man. The Apostle Paul tells us that we are NOT to live like “Gentiles,” and then in 1 Corinthians 2:14, he tells us why unbelievers CANNOT live like believers do, that is, in a spiritual sense. “But the natural man (called here “Gentiles”) receiveth not the things of the Spirit of God: for they are foolishness unto him: neither can he know them, because they are spiritually discerned” (1 Corinthians 2:14). The unregenerate man CANNOT receive the things of God because his heart is dead, his mind is blinded by the god of this age, and he cannot receive the things of the Spirit of God.Verses 17, 18, and 19 give us the picture of the unregenerate, and we are NOT to walk as they walk. By nature, the unregenerate has a mind filled with vanity. His understanding is darkened. The heart of the unregenerate is blind. He has no feeling toward God; he is given over to lasciviousness (sexual desires), uncleanness and self-indulgence.Commentary17 This I say therefore, and testify in the Lord, that ye henceforth walk not as other Gentiles walk, in the vanity of their mind,In these three verses Paul summarizes the teaching he gives at greater length in Romans 1:18-32. It is sobering conscious-probing analysis. It describes the true nature of the world apart from Christ. It is a catalog of what we all are by nature. He puts a spiritual stethoscope to our hearts to let us hear that its beat is out of control.The use of the words “therefore” and “walk” points us back to the same words in 4:1{1]. “Testify,” a strong word of solemn appeal, means to insist or implore. The phrase “in the lord” suggests that Paul is conscious of such a connection with the Lord, that he speaks in the Lord’s name and feels that his words are clothed with divine authority. The appeal itself is stated both negatively and positively. The negative part concerns the “walk” of the Gentiles (17-19) [Gentiles, as used here, refers to those who have never had the special revelation of grace]; the positive part revolves around the concept of “truth [as it] is in Jesus” (20-24).Paul insists that his readers must “no longer walk as the Gentiles walk.” He was saying to the recipients of this letter that they were no longer to live like the Gentiles. They were now “fellow citizens with the saints” and a part of “the household of God.” Their daily walk must conform to their new relationship. “No longer” implies that once they lived as the Gentiles. Now, however, they must renounce the life and wicked ways of their heathen neighbors, and make a clean break with the old bad ways of paganism.The apostle proceeds to enumerate some of the significant features of pagan life in the first century—vanity, darkness, alienation, ignorance, hardness, loss of feeling, lasciviousness, uncleanness, greediness. It is a grim and revolting picture which he draws, and in many respects it parallels the statement of Romans 1:18?“For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness.” The life of the Gentiles, which had once been theirs, is one of spiritual “futility” with “vanity of vanities” written all over it.First, Paul speaks of “the vanity of their mind” and their being “darkened” in “the understanding” (18). “Vanity” suggest emptiness, futility, and purposelessness—life with no real meaning, no goal. The thought is not that unregenerate minds are empty. It is that they are filled with things which lead to nothing. To have “the understanding darkened” is to be without the faculty of discernment, to be unable to distinguish right and wrong.The language Paul uses here and in the other verses expresses his sense of authority as an apostle. He speaks emphatically: “I say and testify in the Lord.” Paul wishes to emphasize his position. His words constitute the solemn and binding testimony of an apostle speaking as the representative of Christ the Lord and with His full authority.Paul does not spare us in his acute analysis of our sinful condition. Notice the flow of his logic:Hardness of heart leads toIgnorance which involves beingAlienated from the life of God which leads to our beingDarkened in our understanding with the result that we becomeCallous andGiven up sensuality and thusGreedy to practice every kind of impurity18 Having the understanding darkened, being alienated from the life of God through the ignorance that is in them, because of the blindness of their heart:Next, non-Christians are described as “being alienated from the life of God.” They are held in the grip of spiritual death, separated from the life which comes from God. The cause of this estrangement is twofold; “the ignorance that is in them” and “the blindness of their heart.” Instead of the word “blindness” most modern versions have “hardness.” The Greek word originally meant “petrifaction” but came eventually to be used by medical writers to represent numbness, insensibility, and callousness. Here it means insensitivity to spiritual things.Apart from Christ’s work the cosmos was destined to futility (Romans 8:20{2]). Apart from God’s special revelation the human race was condemned to futility. It’s every effort to solve the jigsaw puzzle of existence was doomed to frustration. Satisfaction and fulfillment of existence was doomed to frustration. Satisfaction and fulfillment sought in the creation rather than in the Creator, worshipping it rather than Him, became the high road to eternal disappointment.19 Who being past feeling have given themselves over unto lasciviousness, to work all uncleanness with greediness.“Being past feeling” continues the idea suggested by “hardness” (17). The word primarily means “to cease to feel pain,” then “to cease to care”—whether through despair or through recklessness. In this passage it describes, a state of moral insensibility wherein one no longer feels the reproaches of conscience.Being thus destitute of scruples, pagan people gave “themselves over unto lasciviousness, to work all [every kind of] uncleanness with greediness.” Two frightful words are used in this statement. The first is “lasciviousness,” the Greek of which denotes lewd or wanton conduct which shocks public decency. The man who can be described this way no longer cares to hide his sin; it does not matter to him who sees his shame so long as he can gratify his desires. The word translated “greediness” is built on a root which means “too have more.” The Greek word describes a disposition which has absolutely no regard for the rights of others. It is very wide in scope, being used sometimes in reference to material things (translated “covetousness”) and sometimes of such things as sexual indulgence (translated “greediness”), as here. “It is the spirit of the man,” explains Barkley, “who does not care whom he hurts and what method he uses so long as he gets what he desires.”While unbelievers may affirm that their rejection of the Christian faith is fundamentally a matter of intellectual integrity, Paul stresses that the rebellious disposition of the heart drives and directs the understanding. Thus the Scriptures tell us something about the unbeliever which he or she tends to deny, suppress and repress—namely that their rejection of God runs contrary to what they know ‘deep down’ to be true (Romans 1:18-23{3]). Since this was once true of us we need to be reminded to be patient in our witness and to pray for the aluminating and regenerating work of the Spirit as we bear witness to Christ.Scripture and special notes[1} “I therefore, the prisoner of the Lord, beseech you that ye walk worthy of the vocation wherewith ye are called,” (Eph. 4.1)[2} “For the creature was made subject to vanity, not willingly, but by reason of him who hath subjected the same in hope” (Rom. 8:20).[3} “For the wrath of God is revealed from heaven against all ungodliness and unrighteousness of men, who hold the truth in unrighteousness; Because that which may be known of God is manifest in them; for God hath shewed it unto them. For the invisible things of him from the creation of the world are clearly seen, being understood by the things that are made, even his eternal power and Godhead; so that they are without excuse: Because that, when they knew God, they glorified him not as God, neither were thankful; but became vain in their imaginations, and their foolish heart was darkened. Professing themselves to be wise, they became fools, And changed the glory of the uncorruptible God into an image made like to corruptible man, and to birds, and four-footed beasts, and creeping things. (Rom. 1:18-23).", "author": "John Lowe"}, {"date": "Jul 18, 2018", "denom": "Baptist", "title": "Salvation Realized(2018)-3", "sermon": "Series:SUPPLANTING The LEGACY Of WICKEDNESS—Genesis 6:9—10:32A—GOD’s REMOVAL STRATEGY—Genesis 6:9-22Toward Removing the Legacy of WickednessB—GOD’s DESIGNED DESTRUCTION(& Salvation)—Genesis 7:1-24C—SALVATION REALIZED(Getting to Normal)-III—Genesis 8:1-19D—EXPERIENCING The VICTORY/Man’s Response—Genesis 8:20-22E—POTENTIAL For RESTORATION—Genesis 9:1-19F—SAME Ol’ SAME Ol’—Genesis 9:20-29G—The NATIONS—Genesis 10:1-32Attention:True Friendship:A young honeymoon couple were touring southern Florida & happened to stop at one of the rattlesnake farms along the road. After seeing the sights, they engaged in small talk with the man that handled the snakes.“Goodness!” exclaimed the new bride. “You certainly have a dangerous job. Don't you ever get bitten by the snakes?”“Yes, on rare occasions,” answered the handler.“Well,\" she continued, “just what do you do when you're bitten by a snake?”“I always carry a razor-sharp knife in my pocket, & as soon as I am bitten, I make deep criss-cross marks across the fang entry & then suck the poison from the wound & spit it out.”“What, uh...what would happen if you were to accidentally sit on a rattler?” persisted the woman.The snake handler answered, “Ma’am, that will be the day I learn who my real friends are.”*When true friendship is realized you will never regret it!Safe passage was realized/experienced/fulfilled for all on the ark.All on the ark escaped/were saved from the Flood’s destruction.Salvation was realized by those favored by God.How/When is salvation by God accomplished/realized?3 ways salvation by God is realized.Last month we found that, Salvation is realized when & how...1. God DETERMINES(:1-5)2. Man COMPLIES/SUBMITS & RESPONDS(:6-14)3—Salvation is realized when...God RELEASES(:15-19)Explanation: (:15-19) Enter into fullness of salvation:15—“Then God spoke to Noah, saying,:16—““Go out of the ark, you & your wife, & your sons & your sons’ wives with you.”God spoke again to Noah after the ground was dry. There is no record of God speaking with Noah since He had earlier commanded them to enter the ark. They rode out the total destruction of wickedness without hearing God’s voice.Previously God had told them to enter the ark & now—at last(See :10—“waited”)—Noah was told to leave the ark with his family.“Spoke”—rbd daw-bar'—Piel Imperfect—1) To speak, declare, converse, command, promise, warn, threaten, sing—1c) (Piel)—1c1) To speak, 1c2) To promise. Strong—a primitive root; perhaps properly, To arrange; but used figuratively(of words)--To speak; rarely(in a destructive sense)--To subdue.“Go out”—auy yaw-tsaw'—Qal Imperative—1) To go out, come out, exit, go forth. Strong—a primitive root; To go(causatively, bring) out, in a great variety of applications, literally & figuratively, direct & proximally.:17—““Bring out with you every living thing of all flesh that is with you: birds & cattle & every creeping thing that creeps on the earth, so that they may abound on the earth, & be fruitful & multiply on the earth.””:18—“So Noah went out, & his sons & his wife & his sons’ wives with him.”:19—“Every animal, every creeping thing, every bird, & whatever creeps on the earth, according to their families, went out of the ark.””It was also Noah’s responsibility to see that the animals were “brought out” from the ark. He was to do this so that the animals might again “abound” upon the earth., This they were to do by fulfilling their God-ordained directive to be “fruitful & multiply.”Thus Noah exited the ark with “his sons, his wife & his sons’ wives.”Also the animals of all the “families” present, exited the ark. It is very likely that “families” had been produced among the animals during their time on the ark.One day—at the end of all things dealing with this earth—Rapture—Tribulation—Judgment Seat of Christ—1000 yr. reign of Christ—Great White Throne judgment...Christians will enter the fullness of their salvation! We will be released to experience God as we never can in this flesh!“Bring out”(See :16—“Go out”—Qal Imperative)— auy yaw-tsaw'—Hiphil Imperative—1) To go out, come out, exit, go forth. Strong—a primitive root; To go(causatively, bring) out, in a great variety of applications, literally & figuratively, direct & proximally.“Abound”—Urv shaw-rats'—1) (Qal) To teem, swarm, multiply. Strong—a primitive root; To wriggle, i.e. by implication--Swarm or abound.“Fruitful”—hrp paw-raw'—1) To bear fruit, be fruitful, branch off. Strong—a primitive root; To bear fruit (literally or figuratively).“Multiply”—hbr raw-baw'—Qal Perfect—1) Be or become great, be or become many, be or become much, be or become numerous. Strong—a primitive root; To increase (in whatever respect).“Families”—hxpvm mish-paw-khaw'—1) Clan, family. Strong—A family, i.e. Circle of relatives; figuratively--A class(of persons), a species(of animals) or sort(of things); by extension--A tribe or people.Argumentation:Enter into the fullness of salvationMat. 25:13-30—““Watch therefore, for you know neither the day nor the hour in which the Son of Man is coming. “For the kingdom of heaven is like a man traveling to a far country, who called his own servants & delivered his goods to them. “And to one he gave five talents, to another two, & to another one, to each according to his own ability; & immediately he went on a journey. Then he who had received the five talents went & traded with them, & made another five talents. And likewise he who had received two gained two more also. But he who had received one went & dug in the ground, & hid his lord’s money. After a long time the lord of those servants came & settled accounts with them. So he who had received five talents came & brought five other talents, saying, ‘Lord, you delivered to me five talents; look, I have gained five more talents besides them.’ “His lord said to him, ‘Well done, good & faithful servant; you were faithful over a few things, I will make you ruler over many things. Enter into the joy of your lord.’ “He also who had received two talents came & said, ‘Lord, you delivered to me two talents; look, I have gained two more talents besides them.’ “His lord said to him, ‘Well done, good & faithful servant; you have been faithful over a few things, I will make you ruler over many things. Enter into the joy of your lord.’ “Then he who had received the one talent came & said, ‘Lord, I knew you to be a hard man, reaping where you have not sown, & gathering where you have not scattered seed. ‘And I was afraid, & went & hid your talent in the ground. &Look, there you have what is yours.’ “But his lord answered & said to him, ‘You wicked & lazy servant, you knew that I reap where I have not sown, & gather where I have not scattered seed. ‘So you ought to have deposited my money with the bankers, & at my coming I would have received back my own with interest. ‘Therefore take the talent from him, & give it to him who has ten talents. ‘For to everyone who has, more will be given, & he will have abundance; but from him who does not have, even what he has will be taken away. ‘And cast the unprofitable servant into the outer darkness. There will be weeping & gnashing of teeth.’”1Cor. 4:1-5—“Let a man so consider us, as servants of Christ & stewards of the mysteries of God. Moreover it is required in stewards that one be found faithful. But with me it is a very small thing that I should be judged by you or by a human court. In fact, I do not even judge myself. For I know nothing against myself, yet I am not justified by this; but He who judges me is the Lord. Therefore judge nothing before the time, until the Lord comes, who will both bring to light the hidden things of darkness & reveal the counsels of the hearts. Then each one’s praise will come from God.”Rev 21:1-8—“Now I saw a new heaven & a new earth, for the first heaven & the first earth had passed away. Also there was no more sea. Then I, John, saw the holy city, New Jerusalem, coming down out of heaven from God, prepared as a bride adorned for her husband. And I heard a loud voice from heaven saying, “Behold, the tabernacle of God is with men, & He will dwell with them, & they shall be His people. God Himself will be with them & be their God. And God will wipe away every tear from their eyes; there shall be no more death, nor sorrow, nor crying. There shall be no more pain, for the former things have passed away.” Then He who sat on the throne said, “Behold, I make all things new.” And He said to me, “Write, for these words are true & faithful.” And He said to me, “It is done! I am the Alpha & the Omega, the Beginning & the End. I will give of the fountain of the water of life freely to him who thirsts. He who overcomes shall inherit all things, & I will be his God & he shall be My son. But the cowardly, unbelieving, abominable, murderers, sexually immoral, sorcerers, idolaters, & all liars shall have their part in the lake which burns with fire & brimstone, which is the second death.””Salvation is both present & future:Present:2Cor. 5:20-6:2—“Now then, we are ambassadors for Christ, as though God were pleading through us: we implore you on Christ’s behalf, be reconciled to God. For He made Him who knew no sin to be sin for us, that we might become the righteousness of God in Him. We then, as workers together with Him also plead with you not to receive the grace of God in vain. For He says: “In an acceptable time I have heard you, And in the day of salvation I have helped you.” Behold, now is the accepted time; behold, now is the day of salvation.”Jn. 3:3, 5-7—“Jesus answered & said to him, “Most assuredly, I say to you, unless one is born again, he cannot see the kingdom of God.””.....“Jesus answered, “Most assuredly, I say to you, unless one is born of water & the Spirit, he cannot enter the kingdom of God. That which is born of the flesh is flesh, & that which is born of the Spirit is spirit. Do not marvel that I said to you, ‘You must be born again.’”Future:Rom. 13:7-11—“Render therefore to all their due: taxes to whom taxes are due, customs to whom customs, fear to whom fear, honor to whom honor. Owe no one anything except to love one another, for he who loves another has fulfilled the law. For the commandments, “You shall not commit adultery,” “You shall not murder,” “You shall not steal,” “You shall not bear false witness,” “You shall not covet,” & if there is any other commandment, are all summed up in this saying, namely, “You shall love your neighbor as yourself.” Love does no harm to a neighbor; therefore love is the fulfillment of the law. And do this, knowing the time, that now it is high time to awake out of sleep; for now our salvation is nearer than when we first believed.”*1Jn. 3:1-3—“Behold what manner of love the Father has bestowed on us, that we should be called children of God! Therefore the world does not know us, because it did not know Him. Beloved, now we are children of God; & it has not yet been revealed what we shall be, but we know that when He is revealed, we shall be like Him, for we shall see Him as He is. And everyone who has this hope in Him purifies himself, just as He is pure.”Rom. 8:16-25—“The Spirit Himself bears witness with our spirit that we are children of God, & if children, then heirs--heirs of God & joint heirs with Christ, if indeed we suffer with Him, that we may also be glorified together. For I consider that the sufferings of this present time are not worthy to be compared with the glory which shall be revealed in us. For the earnest expectation of the creation eagerly waits for the revealing of the sons of God. For the creation was subjected to futility, not willingly, but because of Him who subjected it in hope; because the creation itself also will be delivered from the bondage of corruption into the glorious liberty of the children of God. For we know that the whole creation groans & labors with birth pangs together until now. Not only that, but we also who have the firstfruits of the Spirit, even we ourselves groan within ourselves, eagerly waiting for the adoption, the redemption of our body. For we were saved in this hope, but hope that is seen is not hope; for why does one still hope for what he sees? But if we hope for what we do not see, we eagerly wait for it with perseverance.”Illustration:My youngest daughter recently traveled by herself from Greensboro, NC to Carrabelle, FL(675 mi.)/She & her Momma then drove to Orlando, FL(300+ mi.) to meet other family/Praise God she had no trouble with the car!/Until she got to Orlando, when it started overheating/On Friday, they limped it into a dealership where they said they could not look at it until Monday—She was supposed to return to Greensboro on Sunday/However, knowing she was from out of town & in a time pinch, the dealership had a change of heart & was gracious enough to have a mechanic replace the water pump on Saturday/She was able to leave on time!/But she was helpless to do anything until the dealership released the car to her!/God RELEASESApplication:?Your Salvation Realized as God RELEASES?? Your Salvation Realized?CONCLUSION:Visualization:True friendship—The snake handler—“Ma’am, that will be the day I learn who my real friends are.”Action:Salvation is realized when...3. God RELEASES(:15-19)1. God DETERMINES(:1-5)2. Man COMPLIES/Submits & Responds(:6-14)Pt# 3 only! Presented 07/15/2018pm to:FBC C’belle206 Storrs Ave.(SE Ave. A)Carrabelle, FL 32322Pts. 1-3 Presented 03/25/2012am to:Needmore Baptist Church1620 Mt. Vernon Rd.Woodleaf, NC 27054", "author": "Byron Sherman"}]}